{
  "EBITDA": "Earnings Before Interest, Taxes, Depreciation, and Amortization. Measures operating profitability.",
  "GAAP": "Generally Accepted Accounting Principles. Standard rules for financial reporting.",
  "non-GAAP": "Financial measures not based on GAAP, often excluding certain costs for clarity.",
  "free cash flow": "Cash generated after capital expenditures, showing financial flexibility.",
  "revenue": "Total income from operations before expenses.",
  "net income": "Profit after all expenses, taxes, and interest.",
  "EPS": "Earnings Per Share. Net income divided by total outstanding shares.",
  "diluted EPS": "Earnings Per Share assuming all convertible securities are exercised.",
  "gross margin": "Revenue minus cost of goods sold, as a percentage of revenue.",
  "operating margin": "Operating income as a percentage of revenue.",
  "CAPEX": "Capital Expenditures. Money spent on acquiring or upgrading assets.",
  "working capital": "Current assets minus current liabilities.",
  "burn rate": "Rate at which a company is spending its capital.",
  "run rate": "Projected future performance based on current results.",
  "guidance": "Company's forecast for future performance.",
  "headwinds": "Negative external factors impacting performance.",
  "tailwinds": "Positive external factors helping performance.",
  "backlog": "Total value of booked but unfulfilled orders.",
  "pipeline": "Upcoming opportunities or deals being pursued.",
  "TAM": "Total Addressable Market. The full revenue opportunity for a product or service.",
  "moat": "A company's competitive advantage that protects it from rivals.",
  "KPI": "Key Performance Indicator. A measurable value showing business performance.",
  "market cap": "Market capitalization. Total value of a company’s outstanding shares.",
  "P/E ratio": "Price-to-Earnings ratio. Stock price divided by earnings per share.",
  "EV/EBITDA": "Enterprise Value to EBITDA ratio. A valuation metric.",
  "beta": "A measure of stock volatility compared to the market.",
  "float": "Shares available for public trading.",
  "10-K": "Annual report filed with the SEC.",
  "10-Q": "Quarterly report filed with the SEC.",
  "8-K": "Report of unscheduled material events or changes.",
  "proxy statement": "Document sent to shareholders before meetings, detailing proposals.",
  "SOX": "Sarbanes-Oxley Act. U.S. law to protect investors from accounting fraud.",
  "fiscal year": "A one-year accounting period that may differ from the calendar year.",
  "accrual": "Recording revenues and expenses when they are incurred, not when cash is exchanged.",
  "amortization": "Gradual expense recognition of intangible assets.",
  "depreciation": "Expense allocation of tangible assets over their useful life.",
  "goodwill": "Intangible asset from acquiring another company for more than its net assets.",
  "inflection point": "A time of significant change or turnaround in the business.",
  "color commentary": "Executive insights that provide additional context beyond the numbers.",
  "soft landing": "A controlled economic slowdown that avoids recession.",
  "buyback": "When a company repurchases its own shares.",
  "dividend": "Cash payment to shareholders from profits.",
  "guidance raised": "Improved future projections provided by the company.",
  "beat and raise": "The company beats expectations and increases future guidance."
}